# Pandas

In [2]:
import pandas as pd

In [3]:
data = [i for i in range(10)]

In [4]:
s1 = pd.Series(data)
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [5]:
index = [chr(i) for i in range(97, 107)]
index

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
s2 = pd.Series(data, index=index)
s2

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [7]:
dict_data = {}

for i in range(10):
    dict_data[index[i]] = data[i]

print(dict_data)

{'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9}

In [8]:
s3 = pd.Series(dict_data)
s3

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [9]:
population = pd.Series(
    [9776, 2729, 1566, 3158]
    , index=['서울', '부산', '인천', '대구']
    )
print(population['서울'])
print()
print(population[['서울', '부산']])
print()
print(population)

9776

서울    9776
부산    2729
dtype: int64

서울    9776
부산    2729
인천    1566
대구    3158
dtype: int64

In [10]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [11]:
s2.iloc[0], s2.loc['a']

(np.int64(0), np.int64(0))

# 데이터 프레임

In [12]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [13]:
# scientists.index = scientists['Name']
# print(scientists)
# print(scientists.loc['William Gosset'])

In [16]:
scientists.to_csv('./data/scientists_1.csv')
scientists.to_csv('./data/scientists_2.csv', index=False)

In [17]:
df = pd.read_csv('./data/scientists_2.csv')

df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [20]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [24]:
# pickle : 파이썬의 객체형을 저장
df1.to_pickle('./data/scientists_pickle.pickle')

In [25]:
df2 = pd.read_pickle('./data/scientists_pickle.pickle')
df2

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician